tutorials/actuators/AC-DBD/old_cases/actuator/AC-DBD/3D/Svarnas2021_baffleEle/flow/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1.0;

// Geometric parameters
L_LHS -10.0e-3;
L_RHS 60.0e-3;
H 40.0e-3;
z_start 0.0;
z_end 10.0e-3;

L_LHS_uni -3.0e-3;
L_RHS_uni 40.0e-3;
H_uni 20.0e-3;

L_LHS_nonUniPerc #calc "fabs($L_LHS - $L_LHS_uni)/fabs($L_RHS - $L_LHS)";
L_RHS_nonUniPerc #calc "fabs($L_RHS - $L_RHS_uni)/fabs($L_RHS - $L_LHS)";
L_uniPerc #calc "1.0 - $L_LHS_nonUniPerc - $L_RHS_nonUniPerc";

H_uniPerc #calc "$H_uni/$H";
H_nonUniPerc #calc "1.0 - $H_uniPerc";

vertices
(
    ($L_LHS 0 $z_start)
    ($L_RHS 0 $z_start)
    ($L_RHS $H $z_start)
    ($L_LHS $H $z_start)
    ($L_LHS 0 $z_end)
    ($L_RHS 0 $z_end)
    ($L_RHS $H $z_end)
    ($L_LHS $H $z_end)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (300 300 20) 
    simpleGrading 
    (
        (
            ($L_LHS_nonUniPerc 0.05 0.1)
            ($L_uniPerc 0.9 1)
            ($L_RHS_nonUniPerc 0.05 3)
        )
        (
            ($H_uniPerc 0.9 1)
            ($H_nonUniPerc 0.1 5)
        )
        20
    )
);

boundary
(
    upperBoundary
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }

    leftBoundary
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }

    rightBoundary
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }

    region0_to_dielectric
    {
        type wall;
        faces
        (
            (1 5 4 0)
        );
    }

    frontAndBack
    {
        type symmetry;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

// ************************************************************************* //
