tutorials/actuators/AC-DBD/old_cases/actuator/AC-DBD/3D/Svarnas2021_baffleEle/flow/0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    upperBoundary
    {
        type            zeroGradient;
    }

    leftBoundary
    {
        type            zeroGradient;
    }

    rightBoundary
    {
        type            zeroGradient;
    }

    region0_to_dielectric
    {
        type            zeroGradient;
    }

    highVoltage
    {
        type            zeroGradient;
    }

    frontAndBack
    {
        type            symmetry;
    }
}


// ************************************************************************* //
