tutorials/actuators/AC-DBD/old_cases/actuator/AC-DBD/3D/Svarnas2021_baffleEle/flow/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    // High Voltage electrode
    {
        name    HVelectrodeSet;
        type    faceSet;
        action  new;
        source  boxToFace;
        sourceInfo
        {
            box (-5.0e-3 0.0 -1.0) (0.0 0.0 1.0);
        }
    }
    {
        name    HVelectrodeZone;
        type    faceZoneSet;
        action  new;
        source  setToFaceZone;
        sourceInfo
        {
            faceSet HVelectrodeSet;
        }
    }


    // Kinetic energy injection
    {
        name    Kinjection;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (0.0 0.0 0.0) (19.0e-3 10.0e-3 5.0e-3);
        }
    }

);

// ************************************************************************* //
