tutorials/actuators/AC-DBD/old_cases/actuator/AC-DBD/3D/Svarnas2021_baffleEle/flow/Allrun
#!/bin/bash
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

./Allclean
./Allmesh
./createForces
./runParallel


#------------------------------------------------------------------------------
